import fontkit from "@pdf-lib/fontkit";
import { PDFDocument, rgb } from "pdf-lib";
import { Button } from "@mantine/core";
import { setDefaultFont, drawGrid, draw, drawRect, drawCenterXText, formatThaiDate, formatThaiDateShort } from "./PdfUtils.js";

async function fillPdf(data) {
	const pdfDoc = await PDFDocument.create();
	pdfDoc.registerFontkit(fontkit);
	const page = pdfDoc.addPage([595, 842]);

	await setDefaultFont(pdfDoc);
	const THSarabunNewBytesBold = await fetch("/fonts/THSarabunNew Bold.ttf").then((res) => res.arrayBuffer());
	const THSarabunNewBold = await pdfDoc.embedFont(THSarabunNewBytesBold);

	drawGrid(page);

	let y = 760;
	let space = 20;
	const lavel = "ปริญญาเอก";
	const type = ""; /* โครงร่าง */
	drawCenterXText(page, "แบบฟอร์มรายงานผลการตรวจสอบการคัดลอกผลงานทางวิชาการ", y + 40, THSarabunNewBold, 20);
	drawCenterXText(page, "นักศึกษาระดับบัณฑิตศึกษา มหาวิทยาลัยราชภัฏกำแพงเพชร", y + 20, THSarabunNewBold, 20);

	const drawItems = [
		{ text: "ข้าพเจ้า ................................................................................................. รหัสประจำตัว .....................................................", x: 100, y: (y -= space) },
		{ text: `นักศึกษาระดับ ${lavel} สาขาวิชา .................................................................หลักสูตร ${lavel === "ปริญญาโท" ? "วิทยานิพนธ์" : "การค้นคว้าอิสระ"}`, x: 60, y: (y -= space) },
		{ text: `ขอส่งรายงานผลการตรวจสอบความคล้ายคลึงของผลงาน${lavel === "ปริญญาโท" ? "วิทยานิพนธ์" : "การค้นคว้าอิสระ"} (Plagiarism Checking)`, x: 100, y: (y -= space * 2) },
		{ text: "ด้วยโปรแกรมอักขราวิสุทธิ์ เพื่อการพิจารณาอนุมัติ", x: 60, y: (y -= space) },

		{ text: `โครงร่าง${lavel === "ปริญญาโท" ? "วิทยานิพนธ์" : "การค้นคว้าอิสระ"}`, x: 140, y: (y -= space), show: type === "โครงร่าง" },
		{ text: `บทที่ 1 มีความคล้ายคลึง กับผลงานผู้อื่น ร้อยละ .............................`, x: 150, y: (y -= space), show: type === "โครงร่าง" },
		{ text: `บทที่ 2 มีความคล้ายคลึง กับผลงานผู้อื่น ร้อยละ .............................`, x: 150, y: (y -= space), show: type === "โครงร่าง" },
		{ text: `บทที่ 3 มีความคล้ายคลึง กับผลงานผู้อื่น ร้อยละ .............................`, x: 150, y: (y -= space), show: type === "โครงร่าง" },
		{ text: `รวมความคล้ายคลึงกับผลงานผู้อื่น ร้อยละ ..........................`, x: 180, y: (y -= space), show: type === "โครงร่าง" },
		{ text: `ตรวจสอบเมื่อวันที่ ............... เดือน ......................... พ.ศ. ................`, x: 150, y: (y -= space), show: type === "โครงร่าง" },

		{ text: `${lavel === "ปริญญาโท" ? "วิทยานิพนธ์" : "การค้นคว้าอิสระ"}`, x: 140, y: (y += space * 5), show: type === "" },
		{ text: `บทที่ 1 มีความคล้ายคลึง กับผลงานผู้อื่น ร้อยละ .............................`, x: 150, y: (y -= space), show: type === "" },
		{ text: `บทที่ 2 มีความคล้ายคลึง กับผลงานผู้อื่น ร้อยละ .............................`, x: 150, y: (y -= space), show: type === "" },
		{ text: `บทที่ 3 มีความคล้ายคลึง กับผลงานผู้อื่น ร้อยละ .............................`, x: 150, y: (y -= space), show: type === "" },
		{ text: `บทที่ 4 มีความคล้ายคลึง กับผลงานผู้อื่น ร้อยละ .............................`, x: 150, y: (y -= space), show: type === "" },
		{ text: `บทที่ 5 มีความคล้ายคลึง กับผลงานผู้อื่น ร้อยละ .............................`, x: 150, y: (y -= space), show: type === "" },
		{ text: `รวมความคล้ายคลึงกับผลงานผู้อื่น ร้อยละ ..........................`, x: 180, y: (y -= space), show: type === "" },
		{ text: `ตรวจสอบเมื่อวันที่ ............... เดือน ......................... พ.ศ. ................`, x: 150, y: (y -= space), show: type === "" },

		{ text: "ข้าพเจ้าขอรับรองว่า ผลงานเรื่องที่เสนอข้างต้น มิได้คัดลอกข้อความของผู้อื่น หากมิเป็นความจริง ข้าพเจ้ายินดีให้", x: 100, y: type === "โครงร่าง" ? (y += space) : (y -= space) },
		{ text: "มหาวิทยาลัยราชภัฏกำแพงเพชรลงโทษตามระเบียบข้อบังคับของมหาวิทยาลัยโดยไม่มีเงื่อนไข", x: 60, y: (y -= space) },

		{ text: `ลงชื่อ...........................................................................`, x: 310, y: (y -= space) },
		{ text: `(.........................................................................)`, x: 330, y: (y -= space) },
		{ text: `นักศึกษา`, x: 400, y: (y -= space) },
		{ text: `วันที่................/........................../......................`, x: 330, y: (y -= space) },
		{ text: `ผลการพิจารณาของประธานที่ปรึกษา${lavel === "ปริญญาโท" ? "วิทยานิพนธ์" : "การค้นคว้าอิสระ"}`, x: 60, y: (y -= space) },
		{ text: "...............................................................................................................................................................................................................", x: 60, y: (y -= space) },
		{ text: `ลงชื่อ...........................................................................`, x: 310, y: (y -= space) },
		{ text: `(.........................................................................)`, x: 330, y: (y -= space) },
		{ text: `อาจารย์ที่ปรึกษา`, x: 385, y: (y -= space) },
		{ text: `วันที่................/........................../......................`, x: 330, y: (y -= space) },
		{ text: `ผลการพิจารณาตรวจสอบของประธานคณะกรรมการบัณฑิตศึกษาประจำสาขา`, x: 60, y: (y -= space) },
		{ text: "...............................................................................................................................................................................................................", x: 60, y: (y -= space) },
		{ text: `ลงชื่อ...........................................................................`, x: 310, y: (y -= space) },
		{ text: `(.........................................................................)`, x: 330, y: (y -= space) },
		{ text: `ประธานกรรมการบัณฑิตศึกษาประจำสาขาวิชา`, x: 330, y: (y -= space) },
		{ text: `ประจำสาขาวิชา.......................................`, x: 330, y: (y -= space) },
		{ text: `วันที่................/........................../......................`, x: 330, y: (y -= space) },
		{ text: `* หมายเหตุ`, x: 60, y: 60, font: THSarabunNewBold },
		{ text: `1. ให้นักศึกษาแนบผลการตรวจสอบการคัดลอกผลงานทางวิชาการด้วยโปรแกรมอักขราวิสุทธิ์ (Plagiarism Checking Report)`, x: 60, y: 40 },
		{ text: `2. แนบแผ่นไฟล์โครงร่างวิทยานิพนธ์/การค้นคว้าอิสระ หรือวิทยานิพนธ์/การค้นคว้าอิสระ ฉบับสมบูรณ์มาด้วย`, x: 60, y: 20 },
	];
	drawItems.filter((item) => item.show !== false).forEach((item) => draw(page, item.text, item.x, item.y, item.font, item.size));

	const pdfBytes = await pdfDoc.save();
	return new Blob([pdfBytes], { type: "application/pdf" });
}

export default function Pdfg02({ data, showType }) {
	const handleOpen = async () => {
		const blob = await fillPdf(data);
		const url = URL.createObjectURL(blob);
		window.open(url, "_blank");
	};

	const handlePrint = async () => {
		const blob = await fillPdf(data);
		const url = URL.createObjectURL(blob);

		const iframe = document.createElement("iframe");
		iframe.style.display = "none";
		iframe.src = url;
		document.body.appendChild(iframe);
		iframe.onload = () => {
			iframe.contentWindow.print();
		};
	};
	return (
		<>
			{showType === "view" ? (
				<Button size="xs" color="gray" onClick={handleOpen}>
					ข้อมูล
				</Button>
			) : (
				<Button size="xs" color="blue" onClick={handlePrint}>
					พิมพ์
				</Button>
			)}
		</>
	);
}
